app/controllers/child_controller.rb

  def index
  	@admind = Director.all
  	@students = StudentDetaile.all
---
SELECT "directors".* FROM "directors"
SELECT "student_detailes".* FROM "student_detailes"

  def students
  	@admind = Director.all
  	@students = StudentDetaile.all
  	@stokes = Stackholder.all
  	@fileUpload = Fileupload.all
---
SELECT "directors".* FROM "directors"
SELECT "student_detailes".* FROM "student_detailes"
SELECT "stackholders".* FROM "stackholders"
SELECT "fileuploads".* FROM "fileuploads"