app/controllers/user_profiles_controller.rb

  def index
    # @user_profiles = UserProfile.all
     @user_profiles = @loging_in_user.user_profiles.all
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ?  [["user_id", 1]]

  def create
    # @user_profile = UserProfile.new(user_profile_params)
     @user_profile = @loging_in_user.user_profiles.new

    respond_to do |format|
      if @user_profile.save
---
INSERT INTO "user_profiles" ("first_name", "last_name", "email_address", "nationality", "gender", "occupation", "phone", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @user_profile.destroy
---
DELETE FROM "user_profiles" WHERE "user_profiles"."id" = ?  [["id", 1]]

    def set_user_profile
      @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = ? LIMIT 1  [["id", 2]]